`terraform plan`

<details><summary>show plan</summary>

```
Terraform will perform the following actions:

  # module.networking.aws_eip.nat_gw_ip[0] will be created
  + resource "aws_eip" "nat_gw_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "web-app-infra-eip-0"
        }
      + tags_all             = {
          + "Name"        = "web-app-infra-eip-0"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_eip.nat_gw_ip[1] will be created
  + resource "aws_eip" "nat_gw_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "web-app-infra-eip-1"
        }
      + tags_all             = {
          + "Name"        = "web-app-infra-eip-1"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "web-app-infra-igw"
        }
      + tags_all = {
          + "Name"        = "web-app-infra-igw"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "web-app-infra-nat-gw-0"
        }
      + tags_all                           = {
          + "Name"        = "web-app-infra-nat-gw-0"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.networking.aws_nat_gateway.nat_gw[1] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "web-app-infra-nat-gw-1"
        }
      + tags_all                           = {
          + "Name"        = "web-app-infra-nat-gw-1"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.networking.aws_route.private_rt_default_route will be created
  + resource "aws_route" "private_rt_default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.networking.aws_route.public_rt_default_route will be created
  + resource "aws_route" "public_rt_default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.networking.aws_route_table.route_tables[0] will be created
  + resource "aws_route_table" "route_tables" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "web-app-infra-pub-rt"
        }
      + tags_all         = {
          + "Name"        = "web-app-infra-pub-rt"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.route_tables[1] will be created
  + resource "aws_route_table" "route_tables" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "web-app-infra-priv-rt"
        }
      + tags_all         = {
          + "Name"        = "web-app-infra-priv-rt"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rt_app_subnet_0 will be created
  + resource "aws_route_table_association" "private_rt_app_subnet_0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rt_app_subnet_1 will be created
  + resource "aws_route_table_association" "private_rt_app_subnet_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rt_db_subnet_0 will be created
  + resource "aws_route_table_association" "private_rt_db_subnet_0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rt_db_subnet_1 will be created
  + resource "aws_route_table_association" "private_rt_db_subnet_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rt_public_subnet_0 will be created
  + resource "aws_route_table_association" "public_rt_public_subnet_0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rt_public_subnet_1 will be created
  + resource "aws_route_table_association" "public_rt_public_subnet_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rt_web_subnet_0 will be created
  + resource "aws_route_table_association" "public_rt_web_subnet_0" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rt_web_subnet_1 will be created
  + resource "aws_route_table_association" "public_rt_web_subnet_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_subnet.app[0] will be created
  + resource "aws_subnet" "app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.128.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-app-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-app-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.app[1] will be created
  + resource "aws_subnet" "app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.160.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-app-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-app-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.db[0] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.192.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-db-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-db-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.db[1] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.224.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-db-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-db-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.0.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-pub-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-pub-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.32.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-pub-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-pub-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.web[0] will be created
  + resource "aws_subnet" "web" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.64.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-web-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-web-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.web[1] will be created
  + resource "aws_subnet" "web" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.96.0/19"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-web-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-web-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.web_app will be created
  + resource "aws_vpc" "web_app" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = false
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "web-app-infra-vpc"
        }
      + tags_all                             = {
          + "Name"        = "web-app-infra-vpc"
          + "application" = "demo-app"
          + "environment" = "dev"
          + "project"     = "web-app-infra"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.

```
</details>